In [1]:
import pandas as pd
import numpy as np

In [10]:
data1.head()

,job_title,job_detail_url,job_listed,company_name,company_link,company_location
0,Data Analyst H/F,https://fr.linkedin.com/jobs/view/data-analyst...,1 day ago,Groupe TF1,https://fr.linkedin.com/company/groupetf1?trk=...,Greater Paris Metropolitan Region
1,Data Scientist,https://fr.linkedin.com/jobs/view/data-scienti...,8 hours ago,Université de Reims Champagne-Ardenne,https://fr.linkedin.com/company/universite-de-...,"Reims, Grand Est, France"
2,Junior Financial Business Analyst,https://fr.linkedin.com/jobs/view/junior-finan...,1 week ago,Accor,https://fr.linkedin.com/company/accor?trk=publ...,"Issy-les-Moulineaux, Île-de-France, France"
3,Media Data intern,https://fr.linkedin.com/jobs/view/media-data-i...,1 week ago,Loewe,https://es.linkedin.com/company/loewe?trk=publ...,"Paris, Île-de-France, France"
4,Data Scientist Assistant,https://fr.linkedin.com/jobs/view/data-scienti...,3 weeks ago,Teads,https://www.linkedin.com/company/teads?trk=pub...,"Montpellier, Occitanie, France"

In [30]:
# Drop rows where any column contains 'not-found'
cleaned_data = data[~data.apply(lambda row: row.astype(str).str.contains('not-found').any(), axis=1)]

In [31]:
# Save the cleaned data to a new CSV file
cleaned_data.to_csv('cleaned_jobs.csv', index=False)

### Import Data

In [6]:
data_1 = pd.read_csv('scrapped jobs.csv')
# Add the new column 'date' and fill it with 2024
data_1['datePublication'] = 2024
data_1.head()

,job_title,job_detail_url,job_listed,company_name,company_link,company_location,datePublication
0,Data Analyst H/F,https://fr.linkedin.com/jobs/view/data-analyst...,1 day ago,Groupe TF1,https://fr.linkedin.com/company/groupetf1?trk=...,Greater Paris Metropolitan Region,2024
1,Data Scientist,https://fr.linkedin.com/jobs/view/data-scienti...,8 hours ago,Université de Reims Champagne-Ardenne,https://fr.linkedin.com/company/universite-de-...,"Reims, Grand Est, France",2024
2,Junior Financial Business Analyst,https://fr.linkedin.com/jobs/view/junior-finan...,1 week ago,Accor,https://fr.linkedin.com/company/accor?trk=publ...,"Issy-les-Moulineaux, Île-de-France, France",2024
3,Media Data intern,https://fr.linkedin.com/jobs/view/media-data-i...,1 week ago,Loewe,https://es.linkedin.com/company/loewe?trk=publ...,"Paris, Île-de-France, France",2024
4,Data Scientist Assistant,https://fr.linkedin.com/jobs/view/data-scienti...,3 weeks ago,Teads,https://www.linkedin.com/company/teads?trk=pub...,"Montpellier, Occitanie, France",2024

In [7]:
# Drop the columns 'job_detail_url' and 'job_listed'
data_1 = data_1.drop(columns=['job_detail_url', 'job_listed','company_name','company_link'])
data_1.head()

,job_title,company_location,datePublication
0,Data Analyst H/F,Greater Paris Metropolitan Region,2024
1,Data Scientist,"Reims, Grand Est, France",2024
2,Junior Financial Business Analyst,"Issy-les-Moulineaux, Île-de-France, France",2024
3,Media Data intern,"Paris, Île-de-France, France",2024
4,Data Scientist Assistant,"Montpellier, Occitanie, France",2024

In [ ]:
combined_data = pd.concat([data_1_cleaned, data_2], ignore_index=True)

In [5]:
data_1.shape

(1189, 5)

In [12]:
# Load the CSV data
data_2 = pd.read_csv('French jobs dataset.csv')
data_2 = data_2.drop(columns=['Unnamed: 0','datePremierePublication', 'LANGUE', 'SAVOIR_ETRE','SAVOIR_FAIRE', 'salaireTexte', 'entreprise', 'enseigne', 'description', 'profil','entreprise_description'])
data_2 = data_2.rename(columns={
    'adresseOffre': 'company_location',
    'intitule': 'job_title'
})
# Remove the time component from the 'date' column
data_2['datePublication'] = data_2['datePublication'].str.split('T').str[0]
data_2.head()

    company_location               job_title datePublication
0  NEUILLY SUR SEINE  Développeur Python F/H      2023-11-23
1           PARIS 18  Développeur Python F/H      2023-11-23
2           PARIS 18  Développeur Python F/H      2023-11-23
3           GRENOBLE  Développeur Python F/H      2023-11-22
4    AIX EN PROVENCE  Developpeur Python F/H      2023-11-22

In [8]:
data.shape

(403, 14)

In [13]:
# Load the CSV data
data_3 = pd.read_csv('data_science_canada_march_2024.csv')
# Select the columns to keep and rename them
data_3 = data_3[['location', 'publishedAt', 'title']].rename(columns={
    'location': 'company_location',
    'publishedAt': 'datePublication',
    'title': 'job_title'
})

In [14]:
data_3.head()

,company_location,datePublication,job_title
0,"Toronto, Ontario, Canada",2024-02-14,"Data Science, Analytics, International"
1,Canada,2024-03-20,Junior Data Scientist
2,"Toronto, Ontario, Canada",2024-02-21,Associate Data Scientist
3,"Toronto, Ontario, Canada",2024-02-08,Data Scientist
4,"Markham, Ontario, Canada",2024-02-29,Data Scientist

In [21]:
data_3.shape

(340, 17)

In [15]:
# Load the CSV data
data_4 = pd.read_csv('linkedin_canada.csv')
data_4 = data_4[['location', 'publishedAt', 'title']].rename(columns={
    'location': 'company_location',
    'publishedAt': 'datePublication',
    'title': 'job_title'
})

In [16]:
data_4.head()

,company_location,datePublication,job_title
0,"Quebec, Canada",2024-01-05,Machine Learning Engineer
1,"Ontario, Canada",2024-01-05,"Data Scientist, Business Analytics"
2,"Montreal, Quebec, Canada",2023-09-15,Data Scientist
3,"Toronto, Ontario, Canada",2023-11-15,"Data Science, Investment Research"
4,"Montreal, Quebec, Canada",2024-01-05,Data Scientist

In [18]:
data_4.shape

(275, 13)

In [17]:
# Load the CSV data
data_5 = pd.read_csv('linkedin-jobs-africa.csv')
data_5 = data_5[['title', 'location', 'posted_date']].rename(columns={
    'location': 'company_location',
    'posted_date': 'datePublication',
    'title': 'job_title'
})
data_5.head()

,job_title,company_location,datePublication
0,Data Analyst,"Cairo, Cairo, Egypt",2022-11-18
1,Data Analyst,"Nairobi County, Kenya",2022-11-01
2,Data Analyst (Credit Risk),"Cape Town, Western Cape, South Africa",2022-11-21
3,Data Analyst,"Nairobi, Nairobi County, Kenya",2022-11-01
4,Data Analyst,"City of Johannesburg, Gauteng, South Africa",2022-10-27

In [33]:
data_5.shape

(2872, 9)

In [18]:
# Load the CSV data
data_6 = pd.read_csv('linkedin-jobs-africa.csv')
data_6 = data_6[['title', 'location', 'posted_date']].rename(columns={
    'location': 'company_location',
    'posted_date': 'datePublication',
    'title': 'job_title'
})
data_6.head()

,job_title,company_location,datePublication
0,Data Analyst,"Cairo, Cairo, Egypt",2022-11-18
1,Data Analyst,"Nairobi County, Kenya",2022-11-01
2,Data Analyst (Credit Risk),"Cape Town, Western Cape, South Africa",2022-11-21
3,Data Analyst,"Nairobi, Nairobi County, Kenya",2022-11-01
4,Data Analyst,"City of Johannesburg, Gauteng, South Africa",2022-10-27

In [38]:
data_6.shape

(2872, 9)

In [19]:
# Load the CSV data
data_7 = pd.read_csv('linkedin-jobs-usa.csv')
data_7 = data_7[['title', 'location', 'posted_date']].rename(columns={
    'location': 'company_location',
    'posted_date': 'datePublication',
    'title': 'job_title'
})
data_7.head()

                        job_title            company_location datePublication
0  Data Analyst - Recent Graduate  Buffalo-Niagara Falls Area      2022-11-22
1  Data Analyst - Recent Graduate                San Jose, CA      2022-11-22
2                    Data Analyst        Texas, United States      2022-11-17
3                    Data Analyst     Illinois, United States      2022-11-17
4        Entry-Level Data Analyst                 Chicago, IL      2022-11-17

In [40]:
data_7.shape

(2845, 9)

                           job_title  \
0                   Data Analyst H/F
1                     Data Scientist
2  Junior Financial Business Analyst
3                  Media Data intern
4           Data Scientist Assistant

                             company_location datePublication
0           Greater Paris Metropolitan Region            2024
1                    Reims, Grand Est, France            2024
2  Issy-les-Moulineaux, Île-de-France, France            2024
3                Paris, Île-de-France, France            2024
4              Montpellier, Occitanie, France            2024
(10796, 3)